# Pandas Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
mylist = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=mylist,index=labels)

a    10
b    20
c    30
dtype: int64

In [4]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [6]:
salesQ1 = pd.Series(data=[250,340,343,543],index = ['a','b','c','e'])

In [7]:
salesQ1

a    250
b    340
c    343
e    543
dtype: int64

In [8]:
salesQ2 = pd.Series(data=[454,344,367,565],index = ['a','b','c','f'])

In [9]:
salesQ2['b']

344

In [10]:
salesQ2[0]

454

In [11]:
salesQ1 + salesQ2

a    704.0
b    684.0
c    710.0
e      NaN
f      NaN
dtype: float64

# Pandas DataFrames : Part 1

In [12]:
columns = ['W','X','Y','Z']
index = ['A','B','C','D','E']

In [13]:
from numpy.random import randint

In [14]:
np.random.seed(42)
data = randint(-100,100,(5,4))

In [15]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [16]:
df = pd.DataFrame(data,index,columns)

In [17]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [20]:
df[['W','Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [21]:
df['new'] = df['W'] + df['Y']

In [22]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [23]:
df = df.drop('new',axis = 1)

In [24]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [25]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [26]:
df.loc[['A','E']]

    W   X   Y   Z
A   2  79  -8 -86
E  30  49 -48 -99

In [27]:
df.iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [28]:
df.iloc[-1]

W    30
X    49
Y   -48
Z   -99
Name: E, dtype: int64

In [29]:
df.drop('C')

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [30]:
df.loc['A','W']

2

# Pandas DataFrame : Part 2

In [31]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [32]:
df[df>0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [33]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [34]:
df[df['X']>0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [35]:
df[(df['W']>0) & (df['Y']>1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [36]:
df[(df['W']>0) | (df['Y']>1)]

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [37]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [38]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [39]:
new_ind = ['DA','GA','BA','CA','EA']

In [40]:
df['states'] = new_ind

In [41]:
df

    W   X   Y   Z states
A   2  79  -8 -86     DA
B   6 -29  88 -80     GA
C   2  21 -26 -13     BA
D  16  -1   3  51     CA
E  30  49 -48 -99     EA

In [42]:
df = df.drop(['states'],axis = 1)

In [43]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [44]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
W    5 non-null int64
X    5 non-null int64
Y    5 non-null int64
Z    5 non-null int64
dtypes: int64(4)
memory usage: 360.0+ bytes

In [46]:
df.dtypes

W    int64
X    int64
Y    int64
Z    int64
dtype: object

# Pandas Missing Data

In [47]:
df = pd.DataFrame({'A': [1,2,np.nan,4],
                  'B':[5,np.nan,np.nan,8],
                  'c':[10,20,30,40]})

In [48]:
df

     A    B   c
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [49]:
df.isnull()

       A      B      c
0  False  False  False
1  False   True  False
2   True   True  False
3  False  False  False

In [50]:
df.isnull().sum()

A    1
B    2
c    0
dtype: int64

In [51]:
df.dropna(axis = 0)

     A    B   c
0  1.0  5.0  10
3  4.0  8.0  40

In [52]:
df.dropna(axis = 1)

    c
0  10
1  20
2  30
3  40

In [53]:
df.fillna(value = 'FILL')

      A     B   c
0     1     5  10
1     2  FILL  20
2  FILL  FILL  30
3     4     8  40

In [54]:
df.fillna(value = 0)

     A    B   c
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [55]:
df['A'] = df['A'].fillna(value = 0)

In [56]:
df

     A    B   c
0  1.0  5.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  40

In [57]:
df['B'].fillna(value = df['B'].mean())

0    5.0
1    6.5
2    6.5
3    8.0
Name: B, dtype: float64

In [58]:
df.fillna(df.mean())

     A    B   c
0  1.0  5.0  10
1  2.0  6.5  20
2  0.0  6.5  30
3  4.0  8.0  40

# GroupBy Operations

In [59]:
df = pd.read_csv('Universities.csv')

In [60]:
df.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [61]:
df.groupby('Year').sum().sort_index(ascending=False)

      Completions
Year
2016        26224
2015        26279
2014        24730
2013        21046
2012        20333

In [62]:
df.groupby(['Year','Sector']).sum()

                                              Completions
Year Sector
2012 Private for-profit, 2-year                      3072
     Private for-profit, 4-year or above              632
     Private for-profit, less-than 2-year            1327
     Private not-for-profit, 2-year                   665
     Private not-for-profit, 4-year or above         1059
     Public, 2-year                                  1170
     Public, 4-year or above                        12408
2013 Private for-profit, 2-year                      3053
     Private for-profit, 4-year or above              775
     Private for-profit, less-than 2-year            1281
     Private not-for-profit, 2-year                   471
     Private not-for-profit, 4-year or above         1016
     Public, 2-year                                  1633
     Public, 4-year or above                        12817
2014 Private for-profit, 2-year                      2957
     Private for-profit, 4-year or above             1506
     Private for-profit, less-than 2-year            1328
     Private not-for-profit, 2-year                   449
     Private not-for-profit, 4-year or above         1042
     Public, 2-year                                  2286
     Public, 4-year or above                        15162
2015 Private for-profit, 2-year                      3280
     Private for-profit, 4-year or above             1306
     Private for-profit, less-than 2-year            1629
     Private not-for-profit, 2-year                   425
     Private not-for-profit, 4-year or above         1228
     Public, 2-year                                  2355
     Public, 4-year or above                        16056
2016 Private for-profit, 2-year                      3286
     Private for-profit, 4-year or above              748
     Private for-profit, less-than 2-year            1552
     Private not-for-profit, 2-year                   322
     Private not-for-profit, 4-year or above         1208
     Public, 2-year                                  2431
     Public, 4-year or above                        16677

In [63]:
df.groupby('Year').describe().transpose()

Year                      2012         2013         2014         2015  \
Completions count    38.000000    40.000000    42.000000    44.000000
            mean    535.078947   526.150000   588.809524   597.250000
            std    1036.433239  1040.474782  1150.355857  1183.371791
            min      13.000000     0.000000     0.000000     0.000000
            25%     114.250000    98.500000   104.500000    87.750000
            50%     229.500000   189.000000   203.500000   191.000000
            75%     420.500000   413.000000   371.750000   405.750000
            max    5388.000000  5278.000000  5093.000000  5335.000000

Year                      2016
Completions count    43.000000
            mean    609.860465
            std    1235.952796
            min       0.000000
            25%      90.000000
            50%     208.000000
            75%     414.000000
            max    5367.000000

# Pandas Operations

In [64]:
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                     'col1':[100,200,300,300,400,500],
                     'col2':['NY','CA','WA','WA','AK','NV']})

In [65]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [66]:
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [67]:
df_one.nunique()

k1      3
col1    5
col2    5
dtype: int64

In [68]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [69]:
df_one['NEW'] = df_one['col1'] * 10

In [70]:
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [71]:
def grab_first_letter(state):
    return state[0]

In [72]:
grab_first_letter('NY')

'N'

In [73]:
df['first_letter']  = df_one['col2'].apply(grab_first_letter)

In [74]:
df

,Sector,University,Year,Completions,Geography,first_letter
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada,N
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada,C
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada,W
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada,W
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada,A
...,...,...,...,...,...,...
202,"Private for-profit, 2-year",Carrington College-Las Vegas,2012,120,Nevada,NaN
203,"Public, 4-year or above",Western Nevada College,2012,495,Nevada,NaN
204,"Private for-profit, 2-year",Nevada Career Institute,2012,101,Nevada,NaN
205,"Private not-for-profit, 2-year",Expertise Cosmetology Institute,2012,129,Nevada,NaN
206,"Public, 2-year",Truckee Meadows Community College,2012,1170,Nevada,NaN

In [75]:
def complex_letter(state):
    if state[0] == "W":
        return "Washington"
    else:
        return "Error"

In [76]:
df_one['col2'].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [77]:
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [78]:
my_map = {'A':1,'B':2,'C':3}

In [79]:
df_one['num'] = df_one['k1'].map(my_map)

In [80]:
df_one

  k1  col1 col2   NEW  num
0  A   100   NY  1000    1
1  A   200   CA  2000    1
2  B   300   WA  3000    2
3  B   300   WA  3000    2
4  C   400   AK  4000    3
5  C   500   NV  5000    3

In [81]:
df_one['col1'].idxmin()

0

In [82]:
df_one['col1'].idxmax()

5

In [83]:
df_one.sort_values('col2')

  k1  col1 col2   NEW  num
4  C   400   AK  4000    3
1  A   200   CA  2000    1
5  C   500   NV  5000    3
0  A   100   NY  1000    1
2  B   300   WA  3000    2
3  B   300   WA  3000    2

In [84]:
features = pd.DataFrame({'A':[100,200,300,400,500],
                         'B':[12,13,14,15,16]})

predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [85]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [86]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [87]:
pd.concat([features,predictions],axis = 1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [88]:
df_one

  k1  col1 col2   NEW  num
0  A   100   NY  1000    1
1  A   200   CA  2000    1
2  B   300   WA  3000    2
3  B   300   WA  3000    2
4  C   400   AK  4000    3
5  C   500   NV  5000    3

In [89]:
pd.get_dummies(df_one['k1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1

# Data Input and Output

In [90]:
df = pd.read_csv('example.csv')

In [91]:
df.head()

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [92]:
df.shape

(4, 4)

In [93]:
df.to_csv('output.csv',index = True)

In [94]:
df = pd.read_csv('output.csv')

In [95]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15